{
  "products": [
    {
      "id": 10001,
      "name": "Basics To Advanced In React",
      "overview": "React is one of the most popular and in-demand technologies in modern web development.",
      "long_description": "Using a component-based approach, React allows you to build interactive user interfaces using JavaScript. This course is designed to teach you everything you need to know to build modern applications using React. You’ll learn to build a Trello-inspired project that will enable you to take advantage of React's features: • Scaffolding projects using the Create React app • React file and folder structures and what they do • What components are and how to use them • Writing JSX • Class-based and function components • Managing state • Looping through data • Using props to pass data and methods to components You won't stop there! Even though React handles the user interface for us, most apps also need a backend. You’ll use Firebase to provide a real-time database for your project. This will help you not only to store your data, but also to be subscribed to any database changes as they happen. You’ll learn how to do the following: • Set up a Firestore database • Push and read data from our database • Update and delete data • Sort and filter data • Work with real-time data using onSnapshot This course will guide you in using Firebase to handle authentication. Users can sign up and log in and out, allowing them to have their own personal boards that only they can see and edit. You’ll also take advantage of React's Context API to pass the user's auth state throughout your application and handle conditional rendering. To round things off, you’ll look at how to build your project for production and then deploy it for the world to see!",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10001.avif",
      "rating": 5,
      "in_stock": true,
      "size": 5,
      "best_seller": true
    },
    {
      "id": 10002,
      "name": "Django Framework for Beginners",
      "overview": "Embark on a structured web development journey from scratch with Python as your trusty companion.",
      "long_description": "This course is designed to introduce Django beginners to all the essential concepts, featuring the latest LTS version. Starting with setting up your development environment, we will guide you through the flow and file structure of Django, ensuring you grasp the fundamental building blocks. As we delve deeper into the course, you will unravel the power of Django URLs, views, and templates, allowing you to create dynamic web applications. After that you will be working with worms and fields, equipping you with the skills to create user-friendly interfaces. Unleash the potential of function-based views to handle complex application logic effortlessly. Stay connected with your users through messages and notifications, enhancing the overall user experience. The Django authentication system is demystified as we guide you through the functionality for registration, login, and logout. Elevate your registration process by integrating Crispy Form, ensuring a seamless user journey. Dive into the world of restrictions, understanding how to enforce limitations on specific pages and headers. Next, you will unlock the power of relationships between models, explore concepts, and stay up to date with the latest security updates in Django, securing your applications and protecting user data. And when it's time to deploy your masterpiece, we will cover the four important pillars of successful deployment: Git, GitHub, Heroku, and the Heroku CLI. By the end of this course, you will be equipped to tackle beginner-level projects with confidence, whether you are pursuing internships, starting as a fresher, or embarking on a freelance journey.",
      "price": 89,
      "poster": "https://images.unsplash.com/photo-1580894894513-541e068a3e2b?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10002.avif",
      "rating": 5,
      "in_stock": true,
      "size": 2,
      "best_seller": false
    },
    {
      "id": 10003,
      "name": "The Future of Design Systems",
      "overview": "This book will give you the confidence to design secure software products and systems.",
      "long_description": "As more software is delivered on the Internet or operates on Internet-connected devices, the design of secure software is critical. This book will give you the confidence to design secure software products and systems and test their designs against threats. This book is the only security book to be chosen as a Dr. Dobbs Jolt Award Finalist since Bruce Schneier?s Secrets and Lies and Applied Cryptography! The book starts with an introduction to threat modeling and focuses on the key new skills that you'll need to threat model and lays out a methodology that's designed for people who are new to threat modeling. Next, you?ll explore approaches to find threats and study the advantages and disadvantages of each approach. Moving ahead, you?ll manage threats and learn about the activities involved in threat modeling. You?ll also focus on threat modeling of specific technologies and find out tricky areas and learn to address them. Towards the end, you?ll shift your attention to the future of threat modeling and its approaches in your organization. By the end of this book, you?ll be able to use threat modeling in the security development lifecycle and in the overall software and systems design processes.",
      "price": 39,
      "poster": "https://images.unsplash.com/photo-1523726491678-bf852e717f6a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10003.avif",
      "rating": 3,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10004,
      "name": "The Complete Guide to Backend Development",
      "overview": "Create server-based and serverless applications using the Express.js and Node.js.",
      "long_description": "This course starts with an introduction to Node.js, then you will explore more about the Node.js filesystem. Following that, you will be learning about Express.js and its use cases. After that, you will work on a small project using Express.js and use various CRUD operations while working on the project. Next, you will build a serverless app with API requests. Throughout the course, you will learn how to set up routes, handle post requests, use middleware, authenticate usernames and passwords with Express and Passport, and use Handlebars for templating. Additionally, you will gain hands-on experience in working with databases, hashing and salting, and setting up sign-up forms and log-out functionality. By the end of this course, you will have the confidence and skills to build your own web applications with the Express framework and Node.js. With code-along sessions, quizzes, and solution files available every step of the way, you will be able to reinforce your knowledge and practice until you feel confident in your ability to develop professional-quality applications.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1595617795501-9661aafda72a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10004.avif",
      "rating": 5,
      "in_stock": true,
      "size": 7,
      "best_seller": true
    },
    {
      "id": 10005,
      "name": "Build a Blockchain from Scratch in Go",
      "overview": "Ethereum is a public, blockchain-based distributed computing platform featuring smart contract functionality.",
      "long_description": "This book is your one-stop guide to blockchain and Ethereum smart contract development. We start by introducing you to the basics of blockchain. You'll learn about hash functions, Merkle trees, forking, mining, and much more. Then you'll learn about Ethereum and smart contracts, and we'll cover Ethereum virtual machine (EVM) in detail. Next, you'll get acquainted with DApps and DAOs and see how they work. We'll also delve into the mechanisms of advanced smart contracts, taking a practical approach. You'll also learn how to develop your own cryptocurrency from scratch in order to understand the business behind ICO. Further on, you'll get to know the key concepts of the Solidity programming language, enabling you to build decentralized blockchain-based applications. We'll also look at enterprise use cases, where you'll build a decentralized microblogging site. At the end of this book, we discuss blockchain-as-a-service, the dark web marketplace, and various advanced topics so you can get well versed with the blockchain principles and ecosystem.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1639322537228-f710d846310a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10005.avif",
      "rating": 2,
      "in_stock": true,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10006,
      "name": "Frontend Fastlane Plan With Projects",
      "overview": "Are you looking to use Vue.js 3 for building web apps but don't know where to begin?",
      "long_description": "Frontend Development Projects with Vue.js 3 will help you get to grips with the core concepts of this JavaScript framework using practical examples that simulate real-world web projects. With this updated edition, you’ll experience all aspects of the new and improved Vue.js 3 as you work on mini projects such as a chat interface, a shopping cart, a price calculator, a to-do app, and a profile card generator for storing contact details. These realistic projects are presented as bite-size exercises that you can enjoy even as you challenge yourself. Throughout the book, you'll discover how to manage data in Vue components, define communication interfaces between components, and handle static and dynamic routing to control application flow. You'll also work with Vite and Vue DevTools and learn how to handle transition and animation effects for an engaging user experience. Finally, you’ll see how to test your app and deploy it to the web. By the end of this Vue.js book, you'll have the skills that enable you to work like an experienced Vue developer to build professional apps that can be used by others and have the confidence to tackle real-world frontend web development problems.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1522542550221-31fd19575a2d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10006.avif",
      "rating": 5,
      "in_stock": true,
      "size": 10,
      "best_seller": false
    },
    {
      "id": 10007,
      "name": "Master the Code Review",
      "overview": "Master the Code Review presents a comprehensive review of modern techniques used to transform raw source code into finished product.",
      "long_description": "In addition to exploring current tools and methods, the guide reviews common techniques and best practices for debugging, testing, and preparing code for commercial release. Throughout, the emphasis is on completeness of coverage in test cases, complete exercise and optimization of code, and use of appropriate procedures and workflows to ensure that changes to code bases are properly recognized, tested, and integrated. The primary development environment targeted in this book is Visual Studio 2008, but even those who use other development environments and toolsets will find the exploration of code analysis and metrics, taxonomies and illustrations of common coding errors, and automated code optimization techniques to be of great interest. The discussion includes methods to reduce code complexity, make most effective use of resources, analyze code path length, and determine optimal use of code libraries, and predefined objects and methods.",
      "price": 49,
      "poster": "https://images.unsplash.com/photo-1621839673705-6617adf9e890?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10007.avif",
      "rating": 4,
      "in_stock": true,
      "size": 2,
      "best_seller": false
    },
    {
      "id": 10008,
      "name": "JavaScript Basics To Advance With Shubham",
      "overview": "JavaScript stands bestride the world like a colossus.",
      "long_description": "Having conquered web development, it now advances into new areas such as server scripting, desktop and mobile development, game scripting, and more. One of the most essential languages for any modern developer, the fully-engaged JavaScript programmer need to know the tricks, non-documented features, quirks, and best practices of this powerful, adaptive language. This all-practical guide is stuffed with code recipes and keys to help you unlock the full potential of JavaScript. Start by diving right into the core of JavaScript, with power user techniques for getting better maintainability and performance from the basic building blocks of your code. Get to grips with modular programming to bring real power to the browser, master client-side JavaScript scripting without jQuery or other frameworks, and discover the full potential of asynchronous coding. Do great things with HTML5 APIs, including building your first web component, tackle the essential requirements of writing large-scale applications, and optimize JavaScript’s performance behind the browser. Wrap up with in-depth advice and best practice for debugging and keeping your JavaScript maintainable for scaling, long-term projects. With every task demonstrated in both classic ES5 JavaScript and next generation ES6-7 versions of the language, Whether read cover-to-cover or dipped into for specific keys and recipes, JavaScript Unlocked is your essential guide for pushing JavaScript to its limits.",
      "price": 49,
      "poster": "https://images.unsplash.com/photo-1613490900233-141c5560d75d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10008.avif",
      "rating": 4,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    },
    {
      "id": 10009,
      "name": "Python Deep Dive With Projects",
      "overview": "Python is a multi-paradigm programming language with object-oriented and structured programming language.",
      "long_description": "Several other paradigms are supported through extensions, including design by contract and logical programming. This course begins with a brief introduction and covers basic to advanced programming techniques in Python. The first 12 sections of the course cover Python basics. The remaining sections cover intermediate to advanced Python concepts (OOPS, classes, lists, modules, functions, JSON, and so on). Learn to use Matplotlib, NumPy, Flask, and Android APK files. Learn database handling and build geographical apps. The ten buildable apps covered in the course include a volcano web map generator, object detector app, personal website built with Python and Flask, book inventory desktop GUI app with SQL backend, data analysis/visualization dashboard, mobile app on Android and iOS devices, an app that scrapes multiple real estate webpages data, web app to collect user data and sends emails, blog and translator with Django, and web app to process Excel files and download processed files. Upon completion, you can create executable Python programs independently and master coding syntax and Python comprehensively.",
      "price": 59,
      "poster": "https://images.unsplash.com/photo-1624953587687-daf255b6b80a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10009.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10010,
      "name": "Mastering Software Technique",
      "overview": "This book is focused on applying techniques to build technical projects, and specifically, to software and system project management",
      "long_description": "The author has many years of experiences. Here, a uniform organization format will be used in the following chapters to discuss each art of business, including: provocative statements, key ideas and techniques, useful practices, examples and stories, and how to evaluate a project. The focus will be on technical problems that one encounters frequently in software project management, rather than on the mechanics of project monitoring. The book also contains some new approaches and insights such as how to elevate the architecture of software system to a very high level by applying multiple leverages and how to do software process control through modleing.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1623479322729-28b25c16b011?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10010.avif",
      "rating": 2,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10011,
      "name": "Web Development Foundation",
      "overview": "Master the art of web development with this comprehensive course on HTML, CSS, and JavaScript.",
      "long_description": "Learn the essential skills and techniques to create stunning web applications, from structuring web pages with HTML tags to styling them with CSS and adding interactivity with JavaScript. In the HTML sections, we'll cover web markup language, creating and structuring web pages, working with links, images, lists, forms, and best practices for accessibility and SEO. In the CSS sections, we'll learn how to style web pages with color, typography, layout, and responsive design. You will also explore CSS frameworks and preprocessors for efficient web development. In the JavaScript sections, we'll cover programming basics, variables, data types, operators, control structures, functions, objects, and working with the DOM for dynamic web content. Throughout the course, you will work on real projects, applying what you have learned to create fully functional web applications. You will design web pages, add interactive elements, and implement JavaScript functionality for a seamless user experience. You will also learn best practices for debugging and optimizing code. By the end of this course, you will have a solid foundation in web development with HTML, CSS, and JavaScript. Create visually appealing and interactive web applications that are optimized for search engines and accessible to all users.",
      "price": 49,
      "poster": "https://images.unsplash.com/photo-1507721999472-8ed4421c4af2?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10011.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    },
    {
      "id": 10012,
      "name": "Mastering Git and GitHub - A Practical Guide",
      "overview": "This course is designed to guide you through working with Git and GitHub.",
      "long_description": "You will start by learning how to install Git and initialize a new Git repository on Windows, Mac, and Linux/Unix systems and then understand how to use it on the command line. Next, you will learn the four types of objects in Git: blobs, trees, commits, and annotated tags. Each object has a unique SHA1 hash. All objects are stored in the folders. Every object has just a single reference to it-SHA1 hash. Files are stored in blobs. Filenames are stored in other Git objects called trees. The videos will guide you through making changes, staging them, and committing them afterward. Also, you will learn and practice how to observe commits tree and checkout different commits to “travel in time” between different states of the Git repository. By the end of this course, you will be well-versed with the basics of Git and GitHub.",
      "price": 9,
      "poster": "https://images.unsplash.com/photo-1618401471353-b98afee0b2eb?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10012.avif",
      "rating": 1,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10013,
      "name": "Diving Deep With Python 2.7",
      "overview": "Python is a great language to get started in the world of programming and application development.",
      "long_description": "This course will help you to take your skills to the next level having a good knowledge of the fundamentals of Python. We begin with the absolute foundation, covering the basic syntax, type variables, and operators. Then we'll move on to concepts such as statements, arrays, operators, string processing, and I/O handling. You’ll learn how to operate tuples, and understand the functions and methods of lists. We’ll help you develop a deep understanding of list and tuples and you’ll learn about the Python dictionary. As you progress through the course, you’ll learn about function parameters and how to use control statements with the loop. Further on, you’ll see how to create modules and packages, storing of data as well as handling errors. Later, we’ll dive into advanced level concepts such as Python collections and you’ll see how to use class, methods, and objects in Python. By the end of this course, you’ll have taken your skills to the next level, with a good knowledge of the fundamentals of Python. This course uses Python 2.7.13, while not the latest version available, it provides relevant and informative content for legacy users of Python.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1515879218367-8466d910aaa4?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10014.avif",
      "rating": 3,
      "in_stock": false,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10014,
      "name": "Kickstart Your UI Design Career",
      "overview": "Vaadin is a mature, open-source, and powerful Java framework used to build modern web applications in plain Java.",
      "long_description": "Vaadin brings back the fun of programming UI interfaces to the web universe. No HTML, no CSS, no JavaScript, no XML. Vaadin lets you implement web user interfaces using an object oriented model, similar to desktop technologies such as Swing and AWT. Vaadin 7 UI Design By Example: Beginner's Guide is an engaging guide that will teach you how to develop web applications in minutes. With this book, you will Develop useful applications and learn basics of Java web development. By the end of the book you will be able to build Java web applications that look fantastic. The book begins with simple examples using the most common Vaadin UI components and quickly move towards more complex applications as components are introduced chapter-by-chapter. Vaadin 7 UI Design By Example: Beginner's Guide shows you how to use Eclipse, Netbeans, and Maven to create Vaadin projects. It then demonstrates how to use labels, text fields, buttons, and other input components. Once you get a grasp of the basic usage of Vaadin, the book explains Vaadin theory to prepare you for the rest of the trip that will enhance your knowledge of Vaadin UI components and customization techniques.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1587440871875-191322ee64b0?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10015.avif",
      "rating": 2,
      "in_stock": false,
      "size": 1,
      "best_seller": false
    }
  ],
  "featured_products": [
    {
      "id": 10004,
      "name": "The Complete Guide to Backend Development",
      "overview": "This comprehensive course is designed to create server-based and serverless applications using the Express framework and Node.js.",
      "long_description": "This course starts with an introduction to Node.js, then you will explore more about the Node.js filesystem. Following that, you will be learning about Express.js and its use cases. After that, you will work on a small project using Express.js and use various CRUD operations while working on the project. Next, you will build a serverless app with API requests. Throughout the course, you will learn how to set up routes, handle post requests, use middleware, authenticate usernames and passwords with Express and Passport, and use Handlebars for templating. Additionally, you will gain hands-on experience in working with databases, hashing and salting, and setting up sign-up forms and log-out functionality. By the end of this course, you will have the confidence and skills to build your own web applications with the Express framework and Node.js. With code-along sessions, quizzes, and solution files available every step of the way, you will be able to reinforce your knowledge and practice until you feel confident in your ability to develop professional-quality applications.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1595617795501-9661aafda72a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10004.avif",
      "rating": 5,
      "in_stock": true,
      "size": 7,
      "best_seller": true
    },
    {
      "id": 10006,
      "name": "Frontend Fastlane Plan With Projects",
      "overview": "Are you looking to use Vue.js 3 for building web apps but don't know where to begin?",
      "long_description": "Frontend Development Projects with Vue.js 3 will help you get to grips with the core concepts of this JavaScript framework using practical examples that simulate real-world web projects. With this updated edition, you’ll experience all aspects of the new and improved Vue.js 3 as you work on mini projects such as a chat interface, a shopping cart, a price calculator, a to-do app, and a profile card generator for storing contact details. These realistic projects are presented as bite-size exercises that you can enjoy even as you challenge yourself. Throughout the book, you'll discover how to manage data in Vue components, define communication interfaces between components, and handle static and dynamic routing to control application flow. You'll also work with Vite and Vue DevTools and learn how to handle transition and animation effects for an engaging user experience. Finally, you’ll see how to test your app and deploy it to the web. By the end of this Vue.js book, you'll have the skills that enable you to work like an experienced Vue developer to build professional apps that can be used by others and have the confidence to tackle real-world frontend web development problems.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1522542550221-31fd19575a2d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10006.avif",
      "rating": 5,
      "in_stock": true,
      "size": 10,
      "best_seller": false
    },
    {
      "id": 10008,
      "name": "JavaScript Basics To Advance With Shubham",
      "overview": "JavaScript stands bestride the world like a colossus.",
      "long_description": "Having conquered web development, it now advances into new areas such as server scripting, desktop and mobile development, game scripting, and more. One of the most essential languages for any modern developer, the fully-engaged JavaScript programmer need to know the tricks, non-documented features, quirks, and best practices of this powerful, adaptive language. This all-practical guide is stuffed with code recipes and keys to help you unlock the full potential of JavaScript. Start by diving right into the core of JavaScript, with power user techniques for getting better maintainability and performance from the basic building blocks of your code. Get to grips with modular programming to bring real power to the browser, master client-side JavaScript scripting without jQuery or other frameworks, and discover the full potential of asynchronous coding. Do great things with HTML5 APIs, including building your first web component, tackle the essential requirements of writing large-scale applications, and optimize JavaScript’s performance behind the browser. Wrap up with in-depth advice and best practice for debugging and keeping your JavaScript maintainable for scaling, long-term projects. With every task demonstrated in both classic ES5 JavaScript and next generation ES6-7 versions of the language, Whether read cover-to-cover or dipped into for specific keys and recipes, JavaScript Unlocked is your essential guide for pushing JavaScript to its limits.",
      "price": 39,
      "poster": "https://images.unsplash.com/photo-1613490900233-141c5560d75d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10008.avif",
      "rating": 4,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    }
  ],
  "orders": [
    {
      "products": [
        {
          "id": 10004,
          "name": "The Complete Guide to Backend Development",
          "overview": "This comprehensive course is designed to create server-based and serverless applications using the Express framework and Node.js.",
          "long_description": "This course starts with an introduction to Node.js, then you will explore more about the Node.js filesystem. Following that, you will be learning about Express.js and its use cases. After that, you will work on a small project using Express.js and use various CRUD operations while working on the project. Next, you will build a serverless app with API requests. Throughout the course, you will learn how to set up routes, handle post requests, use middleware, authenticate usernames and passwords with Express and Passport, and use Handlebars for templating. Additionally, you will gain hands-on experience in working with databases, hashing and salting, and setting up sign-up forms and log-out functionality. By the end of this course, you will have the confidence and skills to build your own web applications with the Express framework and Node.js. With code-along sessions, quizzes, and solution files available every step of the way, you will be able to reinforce your knowledge and practice until you feel confident in your ability to develop professional-quality applications.",
          "price": 99,
          "poster": "https://images.unsplash.com/photo-1595617795501-9661aafda72a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
          "image_local": "/assets/images/10004.avif",
          "rating": 5,
          "in_stock": true,
          "size": 7,
          "best_seller": true
        }
      ],
      "amount_paid": 99,
      "quantity": 1,
      "user": {
        "name": "Rohit Kotian",
        "email": "rkrocks123@gmail.com",
        "cbid": 1
      },
      "id": 1
    }
  ],
  "users": [
    {
      "email": "rkrocks123@gmail.com",
      "password": "$2a$10$utTH11d3vPUIlX.6OFpnO.OhU0NJSo.VOzmN0/9kYTgC.2Ntvp.l2",
      "name": "Rohit Kotian",
      "id": 1
    }
  ]
}
